In [39]:
import pandas as pd #read files
from pathlib import Path

In [125]:
#merging NonProducts into single csv
# List of CSV file names to merge
file_path = '/Users/Tico/Documents/Masters/LaMona/CSV/Non-Products/'
file_names = ['missdivaChildren.csv','yoursChildren.csv','tekshopChildren.csv','skatesChildren.csv','portopetsChildren.csv','rollerbladeChildren.csv','cabinetshopChildren.csv']

# Create an empty DataFrame to store merged data
merged_data = pd.DataFrame()

# Merge CSV files
for filename in file_names:
    nonProductsDataFrame = pd.read_csv(file_path+ filename)
    merged_data = pd.concat([merged_data, nonProductsDataFrame], ignore_index=True)

# Save the merged DataFrame to a new CSV file
merged_data.to_csv(file_path+'NonProducts.csv', index=False)

In [127]:
nonProductsFilePath = open(file_path + 'NonProducts.csv', "r")

In [129]:
nonProductsDataFrame.head()

                                                html  name  price
0  <li>\n<a class="menu-drawer__menu-item link li...   NaN    NaN
1  <a class="menu-drawer__menu-item link link--te...   NaN    NaN
2  <li>\n<a class="menu-drawer__menu-item link li...   NaN    NaN
3  <a class="menu-drawer__menu-item link link--te...   NaN    NaN
4  <li>\n<a class="menu-drawer__menu-item link li...   NaN    NaN

In [131]:
#merging NonProducts into single csv
# List of CSV file names to merge
file_path = '/Users/Tico/Documents/Masters/LaMona/CSV/Products/'
file_names = ['missdivaHeels.csv','yoursCrops&Shorts.csv','tekshopLaptops.csv','skateScooters.csv','portopetsCats.csv','rollerbladeSkates.csv','cabinetshopItems.csv']

# Create an empty DataFrame to store merged data
merged_data = pd.DataFrame()

# Merge CSV files
for filename in file_names:
    ProductsDataFrame = pd.read_csv(file_path+ filename)
    merged_data = pd.concat([merged_data, ProductsDataFrame], ignore_index=True)

# Save the merged DataFrame to a new CSV file
merged_data.to_csv(file_path+'Products.csv', index=False)

In [133]:
ProductsFilePath = open(file_path + 'Products.csv', "r")

In [151]:
ProductsDataFrame.head()

,html,name,price
0,"<div class=""product-block layout-align-above f...",Tani High Platform T-Bar Sandals in Black Pate...,£39.99
1,"<div class=""product-block layout-align-above f...",Lucie Kitten Heel Strappy Mule in Black\n ...,£29.99
2,"<div class=""product-block layout-align-above f...",Tani High Platform T-Bar Sandals in Nude Paten...,£39.99
3,"<div class=""product-block layout-align-above f...",Mila High Stiletto Heel Court Shoe In Black Pa...,£35.00
4,"<div class=""product-block layout-align-above f...",Amanda 3 Diamante Strap T-bar Block Heel Sanda...,£34.99
...,...,...,...
1044,"<li class=""grid__item"">\n<link href=""//thecabi...",2 Drawer TV Stand M1,£239.59 GBP
1045,"<li class=""grid__item"">\n<link href=""//thecabi...",Mid Quad Bookcase M1,£0.00 GBP
1046,"<li class=""grid__item"">\n<link href=""//thecabi...",Low Quad Bookcase M1,£181.76 GBP
1047,"<li class=""grid__item"">\n<link href=""//thecabi...",Low 6 Drawer Chest M2,£364.62 GBP
1048,"<li class=""grid__item"">\n<link href=""//thecabi...",Low Triple Cupboard M2,£210.45 GBP

In [169]:
#merging NonProducts into single csv
# List of CSV file names to merge
file_path = '/Users/Tico/Documents/Masters/LaMona/ModelTraining/'
file_names = ['NonProducts.csv','Products.csv']

df = pd.concat( 
    map(pd.read_csv, [file_path+'NonProducts.csv', file_path+'Products.csv']), ignore_index=True)

,html,name,price
0,"<li class=""disclosure-list__item"">\n<a class=""...",NaN,NaN
1,"<a class=""disclosure-list__option disclosure-o...",NaN,NaN
2,"<span class=""disclosure-option-with-parts__par...",NaN,NaN
3,"<span class=""disclosure-option-with-parts__par...",NaN,NaN
4,"<li class=""disclosure-list__item"">\n<a class=""...",NaN,NaN
...,...,...,...
2308,"<li class=""grid__item"">\n<link href=""//thecabi...",2 Drawer TV Stand M1,£239.59 GBP
2309,"<li class=""grid__item"">\n<link href=""//thecabi...",Mid Quad Bookcase M1,£0.00 GBP
2310,"<li class=""grid__item"">\n<link href=""//thecabi...",Low Quad Bookcase M1,£181.76 GBP
2311,"<li class=""grid__item"">\n<link href=""//thecabi...",Low 6 Drawer Chest M2,£364.62 GBP
2312,"<li class=""grid__item"">\n<link href=""//thecabi...",Low Triple Cupboard M2,£210.45 GBP

In [173]:
df